# -*- coding: utf-8 -*-

import random

alphabet = {
    " " : [100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114],
    "а" : [115, 116, 117, 118, 119, 120],
    "б" : [121, 122],
    "в" : [123, 124, 125, 126],
    "г" : [127, 128],
    "ґ" : [129],
    "д" : [130, 131, 132],
    "е" : [133, 134, 135, 136],
    "є" : [137],
    "ж" : [138],
    "з" : [139, 140],
    "и" : [141, 142, 143, 144, 145],
    "і" : [146, 147, 148, 149],
    "ї" : [150],
    "й" : [151],
    "к" : [152],
    "л" : [153, 154, 155],
    "м" : [156, 157, 158],
    "н" : [159, 160, 161, 162, 163, 164],
    "о" : [165, 166, 167, 168, 169, 170, 171, 172],
    "п" : [173, 174],
    "р" : [179, 180, 181, 182],
    "с" : [183, 184, 185, 186],
    "т" : [187, 188, 189, 190],
    "у" : [191, 192, 193],
    "ф" : [194],
    "х" : [195],
    "ц" : [196],
    "ч" : [197],
    "ш" : [198],
    "щ" : [199],
    "ь" : [200, 201],
    "ю" : [202],
    "я" : [203]
}

def encryption(text):

    text = text.lower()
    print(text)
    encryptedText = ""
    for letter in text:
        encryptedText += str(random.choice(alphabet[letter]))
    return encryptedText


text = "Жив собі хлопчик на імя Вася Він був звичайним хлопчиком як і всі інші Він любив гратися в футбол кататися на велосипеді та проводити час зі своїми друзями Одного разу Вася гуляв у лісі коли побачив щось дивне На гілці дерева висіла маленька пташка Вона була дуже хвора і не могла літати Вася вирішив допомогти пташині Він взяв її додому і доглядав за нею Він годував її напував і навіть робив їй теплий компрес Через кілька днів пташка видужала Вона подякувала Васі і полетіла геть Вася був дуже радий що зміг допомогти пташині Він зрозумів що навіть невелика допомога може зробити світ кращим"
encryptedText = encryption(text)
print(encryptedText)

with open("write.txt", "w", encoding="utf-8") as f:
    f.write(encryptedText)